app/controllers/delitos_controller.rb

  def index
    @delitos = Delito.all
---
SELECT "delitos".* FROM "delitos"