app/controllers/sitios_controller.rb

  def index
    @sitios = Sitio.all
---
SELECT "sitios".* FROM "sitios"

  def create
    @sitio = Sitio.new(sitio_params)

    if @sitio.save
---
INSERT INTO "sitios" ("sitio_nombre", "created_at") VALUES ($1, $2) RETURNING "id"  [["sitio_nombre", "here"], ["created_at", 2017-03-07 22:39:55 UTC]]

  def update
    if @sitio.update(sitio_params)
---
UPDATE "sitios" SET "sitio_nombre" = $1, "updated_at" = $2 WHERE "sitios"."id" = $3  [["sitio_nombre", "here2"], ["updated_at", 2017-03-07 22:56:59 UTC], ["id", 5]]

  def destroy
    @sitio.destroy
---
DELETE FROM "sitios" WHERE "sitios"."id" = $1  [["id", 5]]

    def set_sitio
      @sitio = Sitio.find(params[:id])
---
SELECT  "sitios".* FROM "sitios" WHERE "sitios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]